# import

In [1]:
import pandas as pd
import numpy as np

from faker import Faker # fake data

# Zadanie pandas

## Zadanie 

Stwórz dataframe z dzięsięcioma imionami uczniów i uczennic oraz liczbą
punktów, jakie uzyskali z egzaminu. Następnie sprawdź, jaka była średnia i
mediana wyników.

In [2]:
fake = Faker(locale='pl_PL')
point_range = {"start": 1,
              "stop": 31}
len_col_names = 20

np.random.seed(42)

def name():
    name = fake.name().strip().split(" ")
    if len(name) == 3 :  return name[1]
    else : return name[0]

names = {}
for _ in range(len_col_names):
    names[name()] = np.random.randint(point_range["start"],
                                           point_range["stop"])

df = pd.DataFrame(names.items(), columns=("name","points"))
mean_med = df.describe().iloc[[1,5]]
mean_med
df

         name  points
0       Liwia       7
1       Aleks      19
2        Alan      29
3         Ida      15
4   Arkadiusz      11
5       Jacek       8
6        Adam      29
7        Nela      21
8         Iwo       7
9     Natasza      26
10     Konrad      23
11     Miłosz      11
12   Apolonia      11
13    Urszula      24
14       Tola      21
15     Julita       4
16    Rozalia       8
17      Jerzy      24
18     Stefan       3

## Zadanie 

Bazując na ramce danych utworzonej w poprzednim zadaniu, wyświetl
czwarty wiersz. Następnie zapisz do osobnej ramki tych uczniów, którzy
uzyskali wynik powyżej średniej.

In [3]:
df.head(5)

        name  points
0      Liwia       7
1      Aleks      19
2       Alan      29
3        Ida      15
4  Arkadiusz      11

In [4]:
print(df[3:4])
# print(df.iloc[3])
# print(df.loc[3:3,:])

above_average = df[df.points > df.points.mean()]
above_average

  name  points
3  Ida      15

       name  points
1     Aleks      19
2      Alan      29
6      Adam      29
7      Nela      21
9   Natasza      26
10   Konrad      23
13  Urszula      24
14     Tola      21
17    Jerzy      24

## Zadanie 

Dodaj do ramki trzecią kolumnę, w której znajdzie się procentowy wynik uczniów i uczennic z tego egzaminu (to znaczy, że każda wartość liczbowa musi zostać podzielona przez maksimum punktów, jakie można było na tym egzaminie uzyskać).

Następnie, chcemy zanonimizować kolumnę z imionami: chcemy, by została tylko pierwsza i ostatnia litera imienia. Np. dla imienia “Marcelina” chcemy zachować “M...a”

In [8]:
df["percent_points"] = df.points / (point_range["stop"] - 1)
df.tail()

     name  points  percent_points
14  T...a      21        0.700000
15  J...a       4        0.133333
16  R...a       8        0.266667
17  J...y      24        0.800000
18  S...n       3        0.100000

In [9]:
"""
Następnie, chcemy zanonimizować kolumnę z imionami: chcemy,
by została tylko pierwsza i ostatnia litera imienia.
Np. dla imienia “Marcelina” chcemy zachować “M...a
”"""

df.name = df.name.apply(lambda x: f"{x[0]}...{x[-1]}")
df.head()

    name  points  percent_points
0  L...a       7        0.233333
1  A...s      19        0.633333
2  A...n      29        0.966667
3  I...a      15        0.500000
4  A...z      11        0.366667

## Zadanie 

Połącz ze sobą dwie poniższe ramki.

    student_data1 = pd.DataFrame({
     'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
     'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin']
     })
    student_data2 = pd.DataFrame({
     'student_id': ['S6', 'S7', 'S8', 'S9', 'S10'],
     'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston']
     })

In [ ]:
student_data1 = pd.DataFrame({
 'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
 'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin']
 })

student_data2 = pd.DataFrame({
 'student_id': ['S6', 'S7', 'S8', 'S9', 'S10'],
 'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston']
 })

In [ ]:
student_data = student_data1.append(student_data2)
student_data

## Zadanie 

Do ramki utworzonej w poprzednim zadaniu dodaj informacje o
rezultatach studentów z ramki poniżej.

    exam_results = pd.DataFrame({
     'student_id': ['S2', 'S10', 'S3', 'S1', 'S7', 'S9', 'S5', 'S4', 'S8', 'S6'],
     'marks': [200, 210, 190, 222, 199, 201, 200, 198, 219, 201]
     })

In [ ]:
exam_results = pd.DataFrame({
 'student_id': ['S2', 'S10', 'S3', 'S1', 'S7', 'S9', 'S5', 'S4', 'S8', 'S6'],
 'marks': [200, 210, 190, 222, 199, 201, 200, 198, 219, 201]
 })

In [ ]:
x = student_data.merge(exam_results, on="student_id")
x.describe(include="all")

## wczytaj plik wylosuj imiona i zapisz sobie do df

In [ ]:
data_baby_names = pd.read_csv(r"C:\Users\user\Desktop\Data Science\SDA\SDA szkolenie\Przetwarzanie_zbiorów_danych\files_for_Processing_datasets\ML-datasets-master\US_Baby_Names_right.csv")
r_name = data_baby_names.sample(n= 10).reset_index(drop=True)
data_random_name =  pd.DataFrame(r_name.iloc[:,2])
data_random_name.to_csv("My name for baby.csv")

# Zadania z  RELACYJNYCH BAZ
DANYCH

## Zadanie 

1. Jakie tabele będą nam potrzebne, aby stworzyć szkielet bazy danych do
zarządzania wypożyczalnią samochodów.

2. Jakie relacje powinny być między tabelami samochodów, klientów i
rezerwacji?

3. Co może być kluczem głównym w poszczególnych tabelach?

# Zadania z SQL

## Zadanie 

1. Utwórz bazę danych car_rental i upewnij się, że aktualnie będzie ona
bazą domyślną do wykonywania operacji. (USE car_rental)
2. Dodaj odpowiednie tabele zawierające:
a. cars - car_id, producer, model, year, horse_power, price_per_day
b. clients - client_id, name, surname, address, city
c. bookings - booking_id, client_id, car_id, start_date, end_date,
total_amount
3. *Dodaj autoinkrementację dla kluczy.
4. *Zaktualizuj tabelę bookings o dwa klucze obce, które posiada.